package 动态数组02;

/**
 * @ClassName ArrayList02
 * @Description TODO
 * @Author changxueyi
 * @Date 2020/3/12 21:28
 */
public class ArrayList02 {
    /**
     * 学习数组的创建
     */
    int arr[];
    String[] arr2;
    //这个只是声明了数组，还不能立即访问它的任何元素，因为声明数组只给了数组名字和元素的数据类型
    //还没有分配内存空间
    //数组名字 = new 数组元素的类型【数组元素的个数】
    //数组名字：被连接到的数组变量的名称
    //数组元素的个数:指定数组的个数，即数组的长度

    //数组名字 = new 数组元素的类型【数组元素的个数】

    //声明的同时为数组分配内存
    //数组元素的类型 数组名 = new 数组元素的类型【数组元素的个数】
    //int month[] = new int[12];

    //数组与基本数据类型一样可以进行初始化操作，数组的初始化可分
    /**
     * int arr[]=new int[]{1,2,3,4,5}; //第一种初始化方式
     * int arr2[] ={12,34,29,22}; //第二种初始化方式
     */




}